In [1]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt

In [2]:
# 선수데이터
a=pd.read_csv('./total_players.csv')
a.head()

   age  cap  goal  height                 name nation  salary
0   31   26     0     184         AliKhaseifA.  U.A.E     270
1   29   22     0     176     KhalidEisaKhalid  U.A.E     270
2   22    0     0     185            MohamedAl  U.A.E     225
3   30   24     0     181       FaresJumaFares  U.A.E     495
4   29   41     0     183  MohamedAhmadMohamed  U.A.E     360

In [3]:
# 아시안컵 19년도
asian = pd.read_csv('./data/AsianCup19.csv')
asian.head()

           경기날짜        팀  팀1점수  팀2점수  승패  점수차
0  01.02. 23:00       일본     1     3   0   -2
1  29.01. 23:00     카타르      4     0   2    4
2  28.01. 23:00       이란     0     3   0   -3
3  26.01. 01:00  아랍에미리트      1     0   2    1
4  25.01. 22:00     대한민국     0     1   0   -1

In [4]:
len(asian)

102

In [5]:
asian['팀'].unique()

array(['일본', '카타르 ', '이란', '아랍에미리트 ', '대한민국', '중국', '베트남', '대한민국 ', '호주 ',
       '일본 ', '이란 ', '태국', '요르단', '호주', '이라크', '바레인', '키르기스스탄', '우즈베키스탄',
       '사우디아라비아', '오만', '중국 ', '베트남 ', '레바논', '팔레스타인', '아랍에미리트', '인도',
       '투르크메니스탄', '북한 ', '예멘', '필리핀', '카타르', '우즈베키스탄 ', '시리아', '북한',
       '팔레스타인 '], dtype=object)

In [6]:
# asian 테이블에 국가 뒤에 공백있는거 제거
names = []
for i in asian['팀']:
    names.append(i.strip())

print(names)

['일본', '카타르', '이란', '아랍에미리트', '대한민국', '중국', '베트남', '카타르', '대한민국', '아랍에미리트', '호주', '일본', '이란', '태국', '요르단', '카타르', '아랍에미리트', '일본', '호주', '카타르', '이란', '일본', '이라크', '바레인', '키르기스스탄', '우즈베키스탄', '사우디아라비아', '오만', '중국', '베트남', '레바논', '사우디아라비아', '오만', '일본', '베트남', '이란', '대한민국', '키르기스스탄', '팔레스타인', '호주', '아랍에미리트', '인도', '투르크메니스탄', '오만', '북한', '레바논', '예멘', '베트남', '키르기스스탄', '필리핀', '팔레스타인', '인도', '요르단', '바레인', '카타르', '우즈베키스탄', '일본', '사우디아라비아', '이라크', '이란', '대한민국', '중국', '시리아', '태국', '호주', '아랍에미리트', '북한', '카타르', '투르크메니스탄', '우즈베키스탄', '예멘', '이라크', '중국', '필리핀', '요르단', '시리아', '태국', '바레인', '우즈베키스탄', '일본', '카타르', '사우디아라비아', '이라크', '이란', '대한민국', '중국', '호주', '아랍에미리트', '시리아', '태국', '레바논', '오만', '투르크메니스탄', '북한', '베트남', '예멘', '필리핀', '키르기스스탄', '팔레스타인', '인도', '요르단', '바레인']

In [7]:
asian['팀'] = names

In [8]:
# 피파랭킹 19년도
fifarank = pd.read_csv('./data/FIFARank.csv')
fifarank = fifarank.drop(columns = ['점수'])
fifarank.head()

   랭킹     국가
0   1    벨기에
1   2    프랑스
2   3    브라질
3   4  크로아티아
4   5   잉글랜드

In [9]:
fifarank['국가'].unique()

array(['벨기에', '프랑스', '브라질', '크로아티아', '잉글랜드', '포르투갈', '우루과이', '스위스', '스페인',
       '덴마크', '아르헨티나', '콜롬비아', '칠레', '스웨덴', '네덜란드', '독일', '멕시코', '이탈리아',
       '웨일스', '폴란드', '페루', '오스트리아', '세네갈', '루마니아', '미국', '튀니지', '슬로바키아',
       '우크라이나', '세르비아', '이란', '베네수엘라', '파라과이', '아일랜드', '보스니아 헤르체고비나',
       '북아일랜드', '코스타리카', '아이슬란드', '스코틀랜드', '터키', '모로코', '호주', '체코', '그리스',
       '나이지리아', '몬테네그로', '불가리아', '노르웨이', '러시아', '콩고민주공화국', '일본', '헝가리',
       '가나', '한국', '자메이카', '카메룬', '이집트', '에콰도르', '핀란드', '볼리비아', '알바니아',
       '부르키나파소', '슬로베니아', '온두라스', '말리', '코트디부아르', '기니', '알제리', '마케도니아',
       '사우디아라비아', '엘살바도르', '파나마', '남아공', '카보베르데', '시리아', '우간다', '벨라루스',
       '중국', '캐나다', '아랍에미리트', '퀴라소', '레바논', '오만', '잠비아', '콩고공화국', '가봉',
       '룩셈부르크', '키프로스', '이라크', '조지아', '이스라엘', '키르기스스탄', '트리니다드 토바고',
       '카타르', '베냉', '우즈베키스탄', '에스토니아', '인도', '페로 제도', '팔레스타인', '베트남',
       '모리타니', '아르메니아', '아이티', '리비아', '케냐', '마다가스카르', '아제르바이잔', '니제르',
       '북한', '요르단', '나미비아', '중앙아프리카', '바레인', '짐바브웨', '시에라리온', '필리핀',
       '모잠비크', '태국', '카자흐스탄', '타지키스탄', '기니비사우', '뉴질랜드', '토고', '중국 대북',
       '앙골라', '앤티가 바부다', '수단', '투르크메니스탄', '니카라과', '말라위', '코소보', '라트비아',
       '안도라', '리투아니아', '예멘', '세인트키츠 네비스', '르완다', '탄자니아', '미얀마', '부룬디',
       '중국 홍콩', '에스와티니', '코모로', '솔로몬 제도', '보츠와나', '레소토', '아프가니스탄',
       '적도 기니', '과테말라', '라이베리아', '에티오피아', '몰디브', '수리남', '도미니카 공화국',
       '뉴칼레도니아', '모리셔스', '타히티', '쿠웨이트', '인도네시아', '벨리즈', '네팔', '바베이도스',
       '바누아투', '남수단', '싱가포르', '감비아', '말레이시아', '파푸아뉴기니', '피지', '몰도바',
       '세인트루시아', '캄보디아', '그레나다', '쿠바', '차드', '버뮤다', '가이아나', '도미니카 연방',
       '푸에르토리코', '세인트빈센트 그레나딘', '리히텐슈타인', '몰타', '중국 마카오', '라오스',
       '상투메 프린시페', '부탄', '아루바', '몽골', '세이셸', '쿡 제도', '아메리칸 사모아', '괌',
       '방글라데시', '지브롤터', '브루나이', '동티모르', '사모아', '지부티', '파키스탄', '몬트세랫',
       '스리랑카', '미국령 버진아일랜드', '케이맨 제도', '통가', '에리트레아', '소말리아',
       '영국령 버진아일랜드', '터크스 케이커스 제도', '앵귈라', '바하마', '산마리노'], dtype=object)

In [10]:
# 한국이라 되어있기 때문에 아시안컵 테이블에 있는 대한민국으로 바꿔주기
fifarank.loc[fifarank['국가'] == '한국', '국가'] = '대한민국'

In [11]:
# 피파랭킹 추가하기
tot_ver1 = pd.merge(asian, fifarank, left_on='팀', right_on='국가', how='left')
tot_ver1.head()

           경기날짜       팀  팀1점수  팀2점수  승패  점수차  랭킹      국가
0  01.02. 23:00      일본     1     3   0   -2  50      일본
1  29.01. 23:00     카타르     4     0   2    4  93     카타르
2  28.01. 23:00      이란     0     3   0   -3  29      이란
3  26.01. 01:00  아랍에미리트     1     0   2    1  79  아랍에미리트
4  25.01. 22:00    대한민국     0     1   0   -1  53    대한민국

In [12]:
# null값 확인
tot_ver1.isnull().sum()

경기날짜    0
팀       0
팀1점수    0
팀2점수    0
승패      0
점수차     0
랭킹      0
국가      0
dtype: int64

In [13]:
# 연봉 합계 추가하기
money = a.pivot_table('salary',index='nation', aggfunc=np.sum)
money.head()

            salary
nation
Qatar       147021
U.A.E       606217
australia  2710055
bahrain       3933
china       326027

In [14]:
money = money.reset_index()
money.head()

      nation   salary
0      Qatar   147021
1      U.A.E   606217
2  australia  2710055
3    bahrain     3933
4      china   326027

In [15]:
money['nation']

0            Qatar
1            U.A.E
2        australia
3          bahrain
4            china
5            india
6             iran
7             iraq
8            japan
9            jemen
10          jordan
11      kyrgyzstan
12         lebanon
13     north-korea
14            oman
15       palastine
16     philippines
17    saudi-arabia
18     south-korea
19           syria
20        thailand
21    turkmenistan
22      uzbekistan
23         vietnam
Name: nation, dtype: object

In [16]:
tot_ver1['팀'].unique()

array(['일본', '카타르', '이란', '아랍에미리트', '대한민국', '중국', '베트남', '호주', '태국',
       '요르단', '이라크', '바레인', '키르기스스탄', '우즈베키스탄', '사우디아라비아', '오만', '레바논',
       '팔레스타인', '인도', '투르크메니스탄', '북한', '예멘', '필리핀', '시리아'], dtype=object)

In [17]:
# 수작업..
money.loc[money['nation'] == 'Qatar', 'nation'] = '카타르'
money.loc[money['nation'] == 'U.A.E', 'nation'] = '아랍에미리트'
money.loc[money['nation'] == 'australia', 'nation'] = '호주'
money.loc[money['nation'] == 'bahrain', 'nation'] = '바레인'
money.loc[money['nation'] == 'china', 'nation'] = '중국'
money.loc[money['nation'] == 'india', 'nation'] = '인도'

money.loc[money['nation'] == 'iran', 'nation'] = '이란'
money.loc[money['nation'] == 'iraq', 'nation'] = '이라크'
money.loc[money['nation'] == 'japan', 'nation'] = '일본'
money.loc[money['nation'] == 'jemen', 'nation'] = '예멘'

money.loc[money['nation'] == 'jordan', 'nation'] = '요르단'
money.loc[money['nation'] == 'kyrgyzstan', 'nation'] = '키르기스스탄'
money.loc[money['nation'] == 'lebanon', 'nation'] = '레바논'
money.loc[money['nation'] == 'north-korea', 'nation'] = '북한'

money.loc[money['nation'] == 'oman', 'nation'] = '오만'
money.loc[money['nation'] == 'palastine', 'nation'] = '팔레스타인'
money.loc[money['nation'] == 'philippines', 'nation'] = '필리핀'

money.loc[money['nation'] == 'saudi-arabia', 'nation'] = '사우디아라비아'
money.loc[money['nation'] == 'south-korea', 'nation'] = '대한민국'
money.loc[money['nation'] == 'syria', 'nation'] = '시리아'

money.loc[money['nation'] == 'thailand', 'nation'] = '태국'
money.loc[money['nation'] == 'turkmenistan', 'nation'] = '투르크메니스탄'
money.loc[money['nation'] == 'uzbekistan', 'nation'] = '우즈베키스탄'
money.loc[money['nation'] == 'vietnam', 'nation'] = '베트남'

In [18]:
# 연봉 단위는 '천원'임 (0 세개 뺀 값 -> 너무 단위가 커서)
money.head()

   nation   salary
0     카타르   147021
1  아랍에미리트   606217
2      호주  2710055
3     바레인     3933
4      중국   326027

In [19]:
# 나라이름 중복되는 컬럼 지우기
tot_ver1 = tot_ver1.drop(columns=['국가'])
tot_ver1.head()

           경기날짜       팀  팀1점수  팀2점수  승패  점수차  랭킹
0  01.02. 23:00      일본     1     3   0   -2  50
1  29.01. 23:00     카타르     4     0   2    4  93
2  28.01. 23:00      이란     0     3   0   -3  29
3  26.01. 01:00  아랍에미리트     1     0   2    1  79
4  25.01. 22:00    대한민국     0     1   0   -1  53

In [20]:
# 합치기
tot_ver2 = pd.merge(tot_ver1,money,left_on='팀', right_on='nation', how='left')
tot_ver2 = tot_ver2.drop(columns=['nation'])
tot_ver2.head()

           경기날짜       팀  팀1점수  팀2점수  승패  점수차  랭킹   salary
0  01.02. 23:00      일본     1     3   0   -2  50  6934420
1  29.01. 23:00     카타르     4     0   2    4  93   147021
2  28.01. 23:00      이란     0     3   0   -3  29  4530110
3  26.01. 01:00  아랍에미리트     1     0   2    1  79   606217
4  25.01. 22:00    대한민국     0     1   0   -1  53  6038313

In [21]:
pd.set_option('display.float_format', '{:.5f}'.format) # 지수표현 없이 보는 것
tot_ver2.describe()

           팀1점수      팀2점수        승패       점수차        랭킹        salary
count 102.00000 102.00000 102.00000 102.00000 102.00000     102.00000
mean    1.29412   1.29412   1.00000   0.00000  84.04902 1409822.00980
std     1.33193   1.34671   0.95441   2.18908  27.17067 2215431.73144
min     0.00000   0.00000   0.00000  -6.00000  29.00000    1198.00000
25%     0.00000   0.00000   0.00000  -1.00000  69.00000    4683.00000
50%     1.00000   1.00000   1.00000   0.00000  88.00000  278006.00000
75%     2.00000   2.00000   2.00000   1.00000 100.00000 1416910.00000
max     6.00000   6.00000   2.00000   6.00000 135.00000 6934420.00000

In [22]:
tot_ver2 = tot_ver2.drop(columns=['팀1점수'])
tot_ver2 = tot_ver2.drop(columns=['팀2점수'])
tot_ver2.head()

           경기날짜       팀  승패  점수차  랭킹   salary
0  01.02. 23:00      일본   0   -2  50  6934420
1  29.01. 23:00     카타르   2    4  93   147021
2  28.01. 23:00      이란   0   -3  29  4530110
3  26.01. 01:00  아랍에미리트   2    1  79   606217
4  25.01. 22:00    대한민국   0   -1  53  6038313

In [23]:
tot_ver2['salary'].describe()

count       102.00000
mean    1409822.00980
std     2215431.73144
min        1198.00000
25%        4683.00000
50%      278006.00000
75%     1416910.00000
max     6934420.00000
Name: salary, dtype: float64

In [24]:
tot_ver2['salary'].value_counts()

6934420    7
147021     7
606217     6
4530110    6
1198       5
326027     5
2710055    5
6038313    5
278006     4
4395       4
213108     4
261933     4
794071     4
3933       4
140402     4
918900     4
2887       3
924076     3
4683       3
4141       3
2072       3
1726       3
4840       3
1581188    3
Name: salary, dtype: int64

In [25]:
tot_ver2['랭킹'].unique()

array([ 50,  93,  29,  79,  53,  76, 100,  41, 118, 109,  88, 113,  91,
        95,  69,  82,  81,  99,  97, 127, 135, 116,  74], dtype=int64)

In [26]:
tot_ver2['랭킹']

0       50
1       93
2       29
3       79
4       53
5       76
6      100
7       93
8       53
9       79
10      41
11      50
12      29
13     118
14     109
15      93
16      79
17      50
18      41
19      93
20      29
21      50
22      88
23     113
24      91
25      95
26      69
27      82
28      76
29     100
      ...
72      76
73     116
74     109
75      74
76     118
77     113
78      95
79      50
80      93
81      69
82      88
83      29
84      53
85      76
86      41
87      79
88      74
89     118
90      81
91      82
92     127
93     109
94     100
95     135
96     116
97      91
98      99
99      97
100    109
101    113
Name: 랭킹, Length: 102, dtype: int64

In [27]:
# 카테고리로 변경
tot_ver2['랭킹'] = tot_ver2['랭킹'].astype('category')

In [28]:
tot_ver2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 102 entries, 0 to 101
Data columns (total 6 columns):
경기날짜      102 non-null object
팀         102 non-null object
승패        102 non-null int64
점수차       102 non-null int64
랭킹        102 non-null category
salary    102 non-null int64
dtypes: category(1), int64(3), object(2)
memory usage: 5.7+ KB

In [29]:
# 원래 랭킹이 낮은 것 부터 1 ~ 23까지
tot_ver2['랭킹'].cat.categories = ['%s'%i for i in range(1,24)]

In [30]:
tot_ver2.head()

           경기날짜       팀  승패  점수차  랭킹   salary
0  01.02. 23:00      일본   0   -2   3  6934420
1  29.01. 23:00     카타르   2    4  13   147021
2  28.01. 23:00      이란   0   -3   1  4530110
3  26.01. 01:00  아랍에미리트   2    1   8   606217
4  25.01. 22:00    대한민국   0   -1   4  6038313

In [31]:
tot_ver2['salary'].unique()

array([6934420,  147021, 4530110,  606217, 6038313,  326027,    1198,
       2710055,  140402,  261933,  213108,    3933,  278006,  918900,
        794071,    4395,    4683,    2887,    2072,    4141,  924076,
          1726,    4840, 1581188], dtype=int64)

## * 각 칼럼의 값이 낮을 수록 팀에 유리하다고 가정하고 데이터 변형 -
==> 랭킹 1위는 숫자상으로 가장 낮은 값이지만 가장 유리하다. -> 모든칼럼적용

In [32]:
# 승패 데이터 변경